In [1]:
import numpy as np
import pandas as pd

### Series當 字典

### Series當 1D array

In [2]:
#要留意  明確索引、隱含索引
data =pd.Series(np.linspace(0,1,5),index=[1,2,3,4,5])
data

1    0.00
2    0.25
3    0.50
4    0.75
5    1.00
dtype: float64

In [3]:
data[1],data[2],data[3],data[4],data[5]  #明確索引

(0.0, 0.25, 0.5, 0.75, 1.0)

In [4]:
data[[1,2]]

1    0.00
2    0.25
dtype: float64

In [5]:
data[0:2]  # 切片 => 隱含索引

1    0.00
2    0.25
dtype: float64

loc　=>　對應明確索引
iloc　=>　對應隱含索引
@ 明確　勝　隱含
ix　=>　混合式(可見Dateframe)

## Dataframe

### Dataframe當字典

In [6]:
area_dict = {'California':12345,'Florida':44444,'Illinois':65432,'New_York':191919}
popu_dict = {'California':3333,'Florida':5555,'Illinois':2222,'New_York':4444}
data = pd.DataFrame({"area":area_dict,"pop":popu_dict})
data

              area   pop
California   12345  3333
Florida      44444  5555
Illinois     65432  2222
New_York    191919  4444

In [7]:
data['area']  #字典提取

California     12345
Florida        44444
Illinois       65432
New_York      191919
Name: area, dtype: int64

In [8]:
data.area   #屬性提取 (like R) (物件導向)

California     12345
Florida        44444
Illinois       65432
New_York      191919
Name: area, dtype: int64

In [9]:
#當屬性時的優先順序低，容易起衝突，避免使用!!!
data.area is data['area'] , data.pop is data['pop']

(True, False)

### Dataframe當 多維array

In [10]:
#values 取得array值

In [11]:
data

              area   pop
California   12345  3333
Florida      44444  5555
Illinois     65432  2222
New_York    191919  4444

In [12]:
data.values,data.index  #values會掉成array，index會轉成index

(array([[ 12345,   3333],
        [ 44444,   5555],
        [ 65432,   2222],
        [191919,   4444]], dtype=int64),
 Index(['California', 'Florida', 'Illinois', 'New_York'], dtype='object'))

In [13]:
#轉置矩陣
data.T

      California  Florida  Illinois  New_York
area       12345    44444     65432    191919
pop         3333     5555      2222      4444

loc　=>　對應明確索引
iloc　=>　對應隱含索引
@ 明確　勝　隱含
ix　=>　混合式(可見Dateframe)

In [14]:
data.loc[:'Illinois',:'pop']

             area   pop
California  12345  3333
Florida     44444  5555
Illinois    65432  2222

In [15]:
data.iloc[:3,:2]

             area   pop
California  12345  3333
Florida     44444  5555
Illinois    65432  2222

In [16]:
data.ix[:3,:'pop']

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

             area   pop
California  12345  3333
Florida     44444  5555
Illinois    65432  2222

## Ufuncs
Pandas　在輸出時，可以保留索引、columns_name，具有自動對齊的功能

索引

In [18]:
ser = pd.Series(np.random.randint(0,10,4))
ser

0    5
1    9
2    7
3    2
dtype: int32

In [19]:
np.log(ser)

0    1.609438
1    2.197225
2    1.945910
3    0.693147
dtype: float64

In [20]:
area = pd.Series({'California':12345,'Florida':44444,'Illinois':65432,'New_York':191919},name='area')
population = pd.Series({'California':123,'Florida':321},name='popu')

In [21]:
population/area

California    0.009964
Florida       0.007223
Illinois           NaN
New_York           NaN
dtype: float64

In [22]:
population.index|area.index

Index(['California', 'Florida', 'Illinois', 'New_York'], dtype='object')

In [23]:
population.divide(area, fill_value=0)  #fill_value 避免 NaN (not a number)

California    0.009964
Florida       0.007223
Illinois      0.000000
New_York      0.000000
dtype: float64

In [24]:
df1 = pd.DataFrame(np.random.randint(0,10,(3,4)),columns=['A','B','C','D'])
df1

   A  B  C  D
0  1  5  2  5
1  0  6  0  2
2  9  4  8  5

In [25]:
np.log2(df1)

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: RuntimeWarning: divide by zero encountered in log2
  """Entry point for launching an IPython kernel.

          A         B         C         D
0  0.000000  2.321928  1.000000  2.321928
1      -inf  2.584963      -inf  1.000000
2  3.169925  2.000000  3.000000  2.321928

In [26]:
df2 = pd.DataFrame(np.random.randint(0,10,(3,3)),columns=['C','D','E'])
df2

   C  D  E
0  4  0  9
1  0  9  3
2  4  1  5

In [27]:
df1+df2   #無法全對應到的部分會成為NaN

    A   B   C   D   E
0 NaN NaN   6   5 NaN
1 NaN NaN   0  11 NaN
2 NaN NaN  12   6 NaN

In [28]:
fill = df1.stack().mean()
fill

3.9166666666666665

In [29]:
df1.add(df2,fill_value=fill)   #兩者當中有缺少值的地方填上 fill 的值後在進行運算

           A         B   C   D          E
0   4.916667  8.916667   6   5  12.916667
1   3.916667  9.916667   0  11   6.916667
2  12.916667  7.916667  12   6   8.916667

DF 和 Series一樣，有 broadcasting

In [30]:
df = pd.DataFrame(np.random.randint(10,size=(3,4)),columns=list('qrst'))
df

   q  r  s  t
0  5  8  3  1
1  6  9  3  5
2  7  0  1  3

In [31]:
df.iloc[0]

q    5
r    8
s    3
t    1
Name: 0, dtype: int32

In [32]:
# 直向(row)
df-df.iloc[0]

   q  r  s  t
0  0  0  0  0
1  1  1  0  4
2  2 -8 -2  2

In [33]:
# 橫向(column)
df.subtract(df['r'],axis=0)

   q  r  s  t
0 -3  0 -5 -7
1 -3  0 -6 -4
2  7  0  1  3

### 缺失值 <br>
None : python物件 易出現錯誤 <br>
NaN: 特殊的浮點值 (如同感染病毒，碰到就變NaN) <br>
pandas裡，object、boolean為NaN、None並存，其餘都自動轉為NaN

isnull()、isna() <br>
notnull() <br>
dropna() <br>
fillna()

In [34]:
data = pd.Series([1,0,True,None,'Hello'])

In [35]:
data.isnull()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [36]:
data.isna()

0    False
1    False
2    False
3     True
4    False
dtype: bool

In [37]:
data.dropna()

0        1
1        0
2     True
4    Hello
dtype: object

In [38]:
data.fillna('XX')

0        1
1        0
2     True
3       XX
4    Hello
dtype: object

In [39]:
data = pd.DataFrame([[1,0,True,3,'Hello'],[1,None,'Hello',np.nan,2],['Hello',3,None,np.nan,2],[None,np.nan,None,np.nan,None]],columns=list('abcde'))
data

       a    b      c    d      e
0      1  0.0   True  3.0  Hello
1      1  NaN  Hello  NaN      2
2  Hello  3.0   None  NaN      2
3   None  NaN   None  NaN   None

In [40]:
data.isnull()

       a      b      c      d      e
0  False  False  False  False  False
1  False   True  False   True  False
2  False  False   True   True  False
3   True   True   True   True   True

In [41]:
data.isna()

       a      b      c      d      e
0  False  False  False  False  False
1  False   True  False   True  False
2  False  False   True   True  False
3   True   True   True   True   True

In [42]:
data.dropna()  # row中只要有的就全丟

   a    b     c    d      e
0  1  0.0  True  3.0  Hello

how　=　參數　any　/　all

In [43]:
data.dropna(axis=0,how='all')

       a    b      c    d      e
0      1  0.0   True  3.0  Hello
1      1  NaN  Hello  NaN      2
2  Hello  3.0   None  NaN      2

In [44]:
data.dropna(axis=1) #column中只要有的就全丟

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [45]:
data.dropna(axis=1,how='all')

       a    b      c    d      e
0      1  0.0   True  3.0  Hello
1      1  NaN  Hello  NaN      2
2  Hello  3.0   None  NaN      2
3   None  NaN   None  NaN   None

thresh參數　指定至少要多少個(篩選器)

In [46]:
data.dropna(axis=1,thresh=2)

       a    b      c      e
0      1  0.0   True  Hello
1      1  NaN  Hello      2
2  Hello  3.0   None      2
3   None  NaN   None   None

In [47]:
data.fillna(1.1)

       a    b      c    d      e
0      1  0.0   True  3.0  Hello
1      1  1.1  Hello  1.1      2
2  Hello  3.0    1.1  1.1      2
3    1.1  1.1    1.1  1.1    1.1

In [48]:
#以前一個來填
data.fillna(method='ffill')

       a    b      c    d      e
0      1  0.0   True  3.0  Hello
1      1  0.0  Hello  3.0      2
2  Hello  3.0  Hello  3.0      2
3  Hello  3.0  Hello  3.0      2

In [49]:
#以後一個來填
data.fillna(method='bfill')

       a    b      c    d      e
0      1  0.0   True  3.0  Hello
1      1  3.0  Hello  NaN      2
2  Hello  3.0   None  NaN      2
3   None  NaN   None  NaN   None

In [50]:
#以後一個來填
data.fillna(axis=1,method='bfill')

       a      b      c     d      e
0      1      0   True     3  Hello
1      1  Hello  Hello     2      2
2  Hello      3      2     2      2
3   None   None   None  None   None

In [51]:
#遮罩更新
data[['a','b']].fillna(value=0)

       a    b
0      1  0.0
1      1  0.0
2  Hello  3.0
3      0  0.0

In [52]:
data[['a','b']] = data[['a','b']].fillna(value=0)
data

       a    b      c    d      e
0      1  0.0   True  3.0  Hello
1      1  0.0  Hello  NaN      2
2  Hello  3.0   None  NaN      2
3      0  0.0   None  NaN   None

In [53]:
階層索引(Hierchical Indexing)

SyntaxError: invalid syntax (<ipython-input-53-794a237c17b7>, line 1)

In [54]:
#(週、年份)受限的方法 不佳
index = [('CA',2000),('CA',2010),('NY',2000),('NY',2010),('TX',2000),('TX',2010)]
populations = [3387345,2567837,1235362,1765372,2098984,2098763]
pop = pd.Series(populations,index=index)
pop

(CA, 2000)    3387345
(CA, 2010)    2567837
(NY, 2000)    1235362
(NY, 2010)    1765372
(TX, 2000)    2098984
(TX, 2010)    2098763
dtype: int64

In [55]:
# MultiIndex 比較靈活
index = pd.MultiIndex.from_tuples(index)    #可from(tuple、array)
index

MultiIndex(levels=[['CA', 'NY', 'TX'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [56]:
pop=pop.reindex(index)
pop

CA  2000    3387345
    2010    2567837
NY  2000    1235362
    2010    1765372
TX  2000    2098984
    2010    2098763
dtype: int64

In [57]:
pop.index.names =['state','year']
pop

state  year
CA     2000    3387345
       2010    2567837
NY     2000    1235362
       2010    1765372
TX     2000    2098984
       2010    2098763
dtype: int64

In [58]:
pop['TX']

year
2000    2098984
2010    2098763
dtype: int64

In [59]:
pop['TX',2010]

2098763

index如未排序(如from_product)，不能用切片  %%此處pop是使用 from_tuples(index) 已有排序。

In [60]:
pop2 = pop.sort_index()
pop2

state  year
CA     2000    3387345
       2010    2567837
NY     2000    1235362
       2010    1765372
TX     2000    2098984
       2010    2098763
dtype: int64

In [61]:
pop2['CA':'NY']

state  year
CA     2000    3387345
       2010    2567837
NY     2000    1235362
       2010    1765372
dtype: int64

In [62]:
pop2[:,2010]

state
CA    2567837
NY    1765372
TX    2098763
dtype: int64

　　　＜－－－　stack　－－－<br>
Series　　　　　　　　　　　Dataframe<br>
　　　－－－　unstack　－－－＞

In [63]:
pop_df = pop.unstack()
pop_df

year      2000     2010
state
CA     3387345  2567837
NY     1235362  1765372
TX     2098984  2098763

In [64]:
pop2 = pop_df.stack()
pop2

state  year
CA     2000    3387345
       2010    2567837
NY     2000    1235362
       2010    1765372
TX     2000    2098984
       2010    2098763
dtype: int64

In [65]:
# 方便增加column
pop_df = pd.DataFrame({'total':pop,"under8":[5678765,2345654,8765678,3454355,6763456,3457356]})
pop_df

              total   under8
state year
CA    2000  3387345  5678765
      2010  2567837  2345654
NY    2000  1235362  8765678
      2010  1765372  3454355
TX    2000  2098984  6763456
      2010  2098763  3457356

In [66]:
f_u18 = pop_df['total']/pop_df['under8']
print(type(f_u18))  #縮回 1D array with Multidex
f_u18

<class 'pandas.core.series.Series'>

state  year
CA     2000    0.596493
       2010    1.094721
NY     2000    0.140932
       2010    0.511057
TX     2000    0.310342
       2010    0.607043
dtype: float64

In [67]:
f_u18.unstack()

year       2000      2010
state
CA     0.596493  1.094721
NY     0.140932  0.511057
TX     0.310342  0.607043

### MultiIndex建立方法
<li>以dict建立時 tuple 為 Key
<li>index = 多維list

In [68]:
df = pd.DataFrame(np.random.rand(4,2),
                  index=[['a','a','b','b'],[1,2,2,1]],
                 columns=['ata1','data2'])
df

         ata1     data2
a 1  0.602520  0.229125
  2  0.461707  0.589401
b 2  0.581350  0.306303
  1  0.013088  0.237336

In [69]:
data = {('CA',2000):3387345,('CA',2010):2567837,('NY',2000):1235362,('NY',2010):1765372,('TX',2000):2098984,('TX',2010):2098763}
pop = pd.Series(data)
pop

CA  2000    3387345
    2010    2567837
NY  2000    1235362
    2010    1765372
TX  2000    2098984
    2010    2098763
dtype: int64

In [70]:
index = [('CA',2000),('CA',2010),('NY',2000),('NY',2010),('TX',2000),('TX',2010)]
index = pd.MultiIndex.from_tuples(index)
populations = [3387345,2567837,1235362,1765372,2098984,2098763]
pop = pd.Series(populations,index=index)
pop

CA  2000    3387345
    2010    2567837
NY  2000    1235362
    2010    1765372
TX  2000    2098984
    2010    2098763
dtype: int64

In [71]:
#從tuple
index = [('CA',2000),('CA',2010),('NY',2000),('NY',2010),('TX',2000),('TX',2010)]
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['CA', 'NY', 'TX'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [72]:
#從aary
index = [['CA','CA','NY','NY','TX','TX'],[2000,2010,2000,2010,2000,2010]]
index = pd.MultiIndex.from_arrays(index)
index

MultiIndex(levels=[['CA', 'NY', 'TX'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [73]:
#相乘對應
index = [['CA','NY','TX'],[2000,2010]]
index = pd.MultiIndex.from_product(index)
index

MultiIndex(levels=[['CA', 'NY', 'TX'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [74]:
#直接刻
pd.MultiIndex(levels=[['CA', 'NY', 'TX'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

MultiIndex(levels=[['CA', 'NY', 'TX'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

#### 實用範例

In [75]:
#建立 MultiIndex
indexA=pd.MultiIndex.from_product([[2013,2014],[1,2]],names=['year','visit'])
indexB=pd.MultiIndex.from_product([["Andy","Ashaa","Mike"],['HR','TEMP']],names=['subject','type'])

In [76]:
# np.round 四捨五入
data = np.round(np.random.randn(4,6),1)
print(data)
#針對 y = 1,3,5...加權
data[:,::2]*=100
#全體加權
data+=37
data

[[-0.2  0.8 -0.9  1.2  1.1 -3. ]
 [ 0.3  2.3  0.9  1.   0.8  1.8]
 [-0.2 -0.4  1.  -0.2  0.1  0.2]
 [-0.5 -2.5 -0.1 -1.  -0.3 -1.2]]

array([[ 17. ,  37.8, -53. ,  38.2, 147. ,  34. ],
       [ 67. ,  39.3, 127. ,  38. , 117. ,  38.8],
       [ 17. ,  36.6, 137. ,  36.8,  47. ,  37.2],
       [-13. ,  34.5,  27. ,  36. ,   7. ,  35.8]])

In [77]:
#建立DF
df = pd.DataFrame(data,index=indexA,columns=indexB)
df

subject     Andy        Ashaa         Mike
type          HR  TEMP     HR  TEMP     HR  TEMP
year visit
2013 1      17.0  37.8  -53.0  38.2  147.0  34.0
     2      67.0  39.3  127.0  38.0  117.0  38.8
2014 1      17.0  36.6  137.0  36.8   47.0  37.2
     2     -13.0  34.5   27.0  36.0    7.0  35.8

In [78]:
df.loc[2013]

subject  Andy        Ashaa         Mike
type       HR  TEMP     HR  TEMP     HR  TEMP
visit
1        17.0  37.8  -53.0  38.2  147.0  34.0
2        67.0  39.3  127.0  38.0  117.0  38.8

In [79]:
df['Andy']

type          HR  TEMP
year visit
2013 1      17.0  37.8
     2      67.0  39.3
2014 1      17.0  36.6
     2     -13.0  34.5

In [80]:
#如果要看 每個 HR 請用樞紐

### 索引

#### Series

In [81]:
pop

CA  2000    3387345
    2010    2567837
NY  2000    1235362
    2010    1765372
TX  2000    2098984
    2010    2098763
dtype: int64

In [82]:
pop.index.names=['state','year']
pop

state  year
CA     2000    3387345
       2010    2567837
NY     2000    1235362
       2010    1765372
TX     2000    2098984
       2010    2098763
dtype: int64

In [83]:
#Slice
pop[:,2010]

state
CA    2567837
NY    1765372
TX    2098763
dtype: int64

In [84]:
#mask
pop[pop > 1765371]

state  year
CA     2000    3387345
       2010    2567837
NY     2010    1765372
TX     2000    2098984
       2010    2098763
dtype: int64

In [85]:
#fancy [[]]
pop[['CA','TX']]

state  year
CA     2000    3387345
       2010    2567837
TX     2000    2098984
       2010    2098763
dtype: int64

#### Dataframe

In [86]:
df

subject     Andy        Ashaa         Mike
type          HR  TEMP     HR  TEMP     HR  TEMP
year visit
2013 1      17.0  37.8  -53.0  38.2  147.0  34.0
     2      67.0  39.3  127.0  38.0  117.0  38.8
2014 1      17.0  36.6  137.0  36.8   47.0  37.2
     2     -13.0  34.5   27.0  36.0    7.0  35.8

In [87]:
df['Andy']

type          HR  TEMP
year visit
2013 1      17.0  37.8
     2      67.0  39.3
2014 1      17.0  36.6
     2     -13.0  34.5

In [88]:
df['Andy','HR']

year  visit
2013  1        17.0
      2        67.0
2014  1        17.0
      2       -13.0
Name: (Andy, HR), dtype: float64

In [89]:
df.iloc[:3,:3]    #(row,column)

subject     Andy        Ashaa
type          HR  TEMP     HR
year visit
2013 1      17.0  37.8  -53.0
     2      67.0  39.3  127.0
2014 1      17.0  36.6  137.0

In [90]:
#針對多層index做細部挑選 限於 loc
idx = pd.IndexSlice
df.loc[idx[:,1],idx[:,'HR']]

subject     Andy  Ashaa   Mike
type          HR     HR     HR
year visit
2013 1      17.0  -53.0  147.0
2014 1      17.0  137.0   47.0

In [91]:
df.loc[idx[:,1],]

subject     Andy        Ashaa         Mike
type          HR  TEMP     HR  TEMP     HR  TEMP
year visit
2013 1      17.0  37.8  -53.0  38.2  147.0  34.0
2014 1      17.0  36.6  137.0  36.8   47.0  37.2

In [92]:
df.loc[idx[:,1],idx[:,'HR']]

subject     Andy  Ashaa   Mike
type          HR     HR     HR
year visit
2013 1      17.0  -53.0  147.0
2014 1      17.0  137.0   47.0

### 攤平索引資料

In [93]:
pop

state  year
CA     2000    3387345
       2010    2567837
NY     2000    1235362
       2010    1765372
TX     2000    2098984
       2010    2098763
dtype: int64

In [94]:
#攤平
pop_flat = pop.reset_index(name='population')
pop_flat

  state  year  population
0    CA  2000     3387345
1    CA  2010     2567837
2    NY  2000     1235362
3    NY  2010     1765372
4    TX  2000     2098984
5    TX  2010     2098763

In [95]:
#疊回
pop_flat.set_index(['state','year'])

            population
state year
CA    2000     3387345
      2010     2567837
NY    2000     1235362
      2010     1765372
TX    2000     2098984
      2010     2098763

### 索引聚合處裡

In [96]:
df

subject     Andy        Ashaa         Mike
type          HR  TEMP     HR  TEMP     HR  TEMP
year visit
2013 1      17.0  37.8  -53.0  38.2  147.0  34.0
     2      67.0  39.3  127.0  38.0  117.0  38.8
2014 1      17.0  36.6  137.0  36.8   47.0  37.2
     2     -13.0  34.5   27.0  36.0    7.0  35.8

In [97]:
df_mean1 = df.mean(level='year')
df_mean1

subject  Andy        Ashaa         Mike
type       HR   TEMP    HR  TEMP     HR  TEMP
year
2013     42.0  38.55  37.0  38.1  132.0  36.4
2014      2.0  35.55  82.0  36.4   27.0  36.5

In [98]:
df_mean2 = df.mean(level='visit')
df_mean2

subject  Andy       Ashaa        Mike
type       HR  TEMP    HR  TEMP    HR  TEMP
visit
1        17.0  37.2  42.0  37.5  97.0  35.6
2        27.0  36.9  77.0  37.0  62.0  37.3

In [99]:
df_mean3 = df.mean(axis=1)
df_mean3

year  visit
2013  1        36.833333
      2        71.183333
2014  1        51.933333
      2        21.216667
dtype: float64

In [100]:
df_mean4 = df.mean(axis=1,level='type')
df_mean4

type                HR       TEMP
year visit
2013 1       37.000000  36.666667
     2      103.666667  38.700000
2014 1       67.000000  36.866667
     2        7.000000  35.433333

### 資料整併

In [101]:
def make_df(cols,ind):
    '''產生DF'''
    data = {c:[str(c)+str(i) for i in ind] for c in cols}
    return pd.DataFrame(data, ind)

In [102]:
make_df('ABC',range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [104]:
#numpy--concatenate()
x=[1,2,3]
y=[4,5,6]
z=[7,8,9]
np.concatenate([x,y,z])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

#### concat()

In [106]:
#Serice、Dataframe()--concat()
ser1 = pd.Series(list('ABC'),index=[1,2,3])
ser2 = pd.Series(list('DEF'),index=[4,5,6])
pd.concat([ser1,ser2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [112]:
#Serice、Dataframe()--concat()
df1 = make_df('AB',[1,2])
df2 = make_df('BC',[2,3])
pd.concat([df1,df2])
                    #有重複索引現象

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  after removing the cwd from sys.path.

     A   B    C
1   A1  B1  NaN
2   A2  B2  NaN
2  NaN  B2   C2
3  NaN  B3   C3

In [121]:
df1 = make_df('AB',[1,2])
df2 = make_df('BC',[2,3])
pd.concat([df1,df2],axis=1)

     A    B    B    C
1   A1   B1  NaN  NaN
2   A2   B2   B2   C2
3  NaN  NaN   B3   C3

In [131]:
#重複索引     (pd的index會被保留)
x = make_df('AB',[0,1])
y = make_df('AB',[2,3])
print(x.index)
print(y.index)
print()
x.index=y.index
print(x.index)
print(y.index)
print(x)
print(y)
print(pd.concat([x,y]))

Int64Index([0, 1], dtype='int64')
Int64Index([2, 3], dtype='int64')

Int64Index([2, 3], dtype='int64')
Int64Index([2, 3], dtype='int64')
    A   B
2  A0  B0
3  A1  B1
    A   B
2  A2  B2
3  A3  B3
    A   B
2  A0  B0
3  A1  B1
2  A2  B2
3  A3  B3

In [132]:
# verify_integrity= 參數 是否將重複索引視為錯誤
pd.concat([x,y],verify_integrity=True)

ValueError: Indexes have overlapping values: Int64Index([2, 3], dtype='int64')

In [133]:
#ignore_index= 參數，
pd.concat([x,y],ignore_index=True)

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [135]:
#ignore_index= 參數，
pd.concat([x,y],keys=['x','y'])

      A   B
x 2  A0  B0
  3  A1  B1
y 2  A2  B2
  3  A3  B3

In [136]:
df1 = make_df('AB',[1,2])
df2 = make_df('BC',[2,3])
pd.concat([df1,df2])

D:\Anaconda3\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  This is separate from the ipykernel package so we can avoid doing imports until

     A   B    C
1   A1  B1  NaN
2   A2  B2  NaN
2  NaN  B2   C2
3  NaN  B3   C3

In [138]:
# join參數 
pd.concat([df1,df2],join='inner')

    B
1  B1
2  B2
2  B2
3  B3

In [140]:
# join_axis參數 (left_join、right_join)
print(df1.columns)
pd.concat([df1,df2],join_axes=[df1.columns])

Index(['A', 'B'], dtype='object')

     A   B
1   A1  B1
2   A2  B2
2  NaN  B2
3  NaN  B3

#### append()
效率差

In [141]:
df1.append(df2)

D:\Anaconda3\lib\site-packages\pandas\core\frame.py:6211: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

     A   B    C
1   A1  B1  NaN
2   A2  B2  NaN
2  NaN  B2   C2
3  NaN  B3   C3

### pd.merge()
merge(left, right, how='inner', on=None, left_on=None, right_on=None,<br>
　　　left_index=False, right_index=False, sort=True,<br>
　　　suffixes=('_x', '_y'), copy=True, indicator=False)<br>
為獨立資料

In [169]:
#一對一
df1 = pd.DataFrame({'employee':['Bob','Jake','Lisa','Sue'],
                   'group':['Accounting','Engineering','Engineering','HR']})
df2 = pd.DataFrame({'employee':['Lisa','Bob','Jake','Sue'],
                   'hire_date':[2004,2008,2012,2014]})
print(df1)
print(df2)
print(pd.merge(df1,df2))
print(pd.merge(df2,df1))
df3 = pd.merge(df1,df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
  employee  hire_date        group
0     Lisa       2004  Engineering
1      Bob       2008   Accounting
2     Jake       2012  Engineering
3      Sue       2014           HR

In [171]:
#多對一
df4= pd.DataFrame({'group':['Accounting','Engineering','HR'],
                   'supervisor':['Carly','Guido','Steve']})
print(df3)
print(df4)
print(pd.merge(df3,df4))
print(pd.merge(df4,df3))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve
         group supervisor employee  hire_date
0   Accounting      Carly      Bob       2008
1  Engineering      Guido     Jake       2012
2  Engineering      Guido     Lisa       2004
3           HR      Steve      Sue       2014

In [174]:
#多對多
df5= pd.DataFrame({'group':['Accounting','Engineering','HR','Engineering','HR'],
                   'skill':['Math','Coding','Linux','Spreadsheets','Spreadsheets']})
print(df1);print(df5);print(pd.merge(df1,df5))

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
         group         skill
0   Accounting          Math
1  Engineering        Coding
2           HR         Linux
3  Engineering  Spreadsheets
4           HR  Spreadsheets
  employee        group         skill
0      Bob   Accounting          Math
1     Jake  Engineering        Coding
2     Jake  Engineering  Spreadsheets
3     Lisa  Engineering        Coding
4     Lisa  Engineering  Spreadsheets
5      Sue           HR         Linux
6      Sue           HR  Spreadsheets

#### on 參數
指定合併的keyword (沒設會自動找)

In [175]:
pd.merge(df1,df2)

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [176]:
pd.merge(df1,df2,on='employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

以欄位為基準進行表格合併：Left_on、Right_on

In [179]:
df3 = pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'],
                   'Salary':[7000,8000,6000,78000]})
print(df1);print(df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
   name  Salary
0   Bob    7000
1  Jake    8000
2  Lisa    6000
3   Sue   78000

In [180]:
pd.merge(df1,df3,left_on='employee',right_on='name')

  employee        group  name  Salary
0      Bob   Accounting   Bob    7000
1     Jake  Engineering  Jake    8000
2     Lisa  Engineering  Lisa    6000
3      Sue           HR   Sue   78000

In [182]:
#去除多餘欄位
pd.merge(df1,df3,left_on='employee',right_on='name').drop('name',axis=1)

  employee        group  Salary
0      Bob   Accounting    7000
1     Jake  Engineering    8000
2     Lisa  Engineering    6000
3      Sue           HR   78000

合併index時需指定：left_index、right_index

In [184]:
df1a=df1.set_index('employee')
df2a=df2.set_index('employee')
print(df1a);print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [186]:
pd.merge(df1a,df2a,left_index=True,right_index=True)

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

合併遇到重複時的代號規則：suffixes

In [191]:
df8 = pd.DataFrame({'name':['Andy','Bob','Sandra'],
                   'score':[87,76,65]})
df9 = pd.DataFrame({'name':['Andy','Bob','Sandra'],
                   'score':[98,77,88]})
print(df8);print(df9)

     name  score
0    Andy     87
1     Bob     76
2  Sandra     65
     name  score
0    Andy     98
1     Bob     77
2  Sandra     88

In [193]:
print(pd.merge(df8,df9,on='name')); #預設為 _x、_y、.....
print(pd.merge(df8,df9,on='name',suffixes=['_Math','_English']))

     name  score_x  score_y
0    Andy       87       98
1     Bob       76       77
2  Sandra       65       88
     name  score_Math  score_English
0    Andy          87             98
1     Bob          76             77
2  Sandra          65             88

In [ ]:
#待補充

### 聚合計算與分組

In [198]:
#匯入行星資訊
import seaborn as sns
planets =sns.load_dataset('planets')
print(planets.shape)
planets.head()

(1035, 6)

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [202]:
#包含 na 資料筆數的常見統計
planets.describe()

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [203]:
#排除 na 資料筆數的常見統計
planets.dropna().describe()

          number  orbital_period        mass    distance         year
count  498.00000      498.000000  498.000000  498.000000   498.000000
mean     1.73494      835.778671    2.509320   52.068213  2007.377510
std      1.17572     1469.128259    3.636274   46.596041     4.167284
min      1.00000        1.328300    0.003600    1.350000  1989.000000
25%      1.00000       38.272250    0.212500   24.497500  2005.000000
50%      1.00000      357.000000    1.245000   39.940000  2009.000000
75%      2.00000      999.600000    2.867500   59.332500  2011.000000
max      6.00000    17337.500000   25.000000  354.000000  2014.000000

#### GroupBy 物件
aggregate()<br>
filter()<br>
transform()<br>
apply()

In [204]:
# lazy
planets.groupby('method')

In [211]:
planets.groupby('method').median()

                               number  orbital_period   mass  distance    year
method
Astrometry                        1.0      631.180000    NaN    17.875  2011.5
Eclipse Timing Variations         2.0     4343.500000  5.125   315.360  2010.0
Imaging                           1.0    27500.000000    NaN    40.395  2009.0
Microlensing                      1.0     3300.000000    NaN  3840.000  2010.0
Orbital Brightness Modulation     2.0        0.342887    NaN  1180.000  2011.0
Pulsar Timing                     3.0       66.541900    NaN  1200.000  1994.0
Pulsation Timing Variations       1.0     1170.000000    NaN       NaN  2007.0
Radial Velocity                   1.0      360.200000  1.260    40.445  2009.0
Transit                           1.0        5.714932  1.470   341.000  2012.0
Transit Timing Variations         2.0       57.011000    NaN   855.000  2012.5

In [210]:
planets.groupby('method')['orbital_period'].median()

method
Astrometry                         631.180000
Eclipse Timing Variations         4343.500000
Imaging                          27500.000000
Microlensing                      3300.000000
Orbital Brightness Modulation        0.342887
Pulsar Timing                       66.541900
Pulsation Timing Variations       1170.000000
Radial Velocity                    360.200000
Transit                              5.714932
Transit Timing Variations           57.011000
Name: orbital_period, dtype: float64

In [212]:
planets.groupby('method')['year'].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,2011.500000,2.121320,2010.0,2010.75,2011.5,2012.25,2013.0
Eclipse Timing Variations,9.0,2010.000000,1.414214,2008.0,2009.00,2010.0,2011.00,2012.0
Imaging,38.0,2009.131579,2.781901,2004.0,2008.00,2009.0,2011.00,2013.0
Microlensing,23.0,2009.782609,2.859697,2004.0,2008.00,2010.0,2012.00,2013.0
Orbital Brightness Modulation,3.0,2011.666667,1.154701,2011.0,2011.00,2011.0,2012.00,2013.0
Pulsar Timing,5.0,1998.400000,8.384510,1992.0,1992.00,1994.0,2003.00,2011.0
Pulsation Timing Variations,1.0,2007.000000,NaN,2007.0,2007.00,2007.0,2007.00,2007.0
Radial Velocity,553.0,2007.518987,4.249052,1989.0,2005.00,2009.0,2011.00,2014.0
Transit,397.0,2011.236776,2.077867,2002.0,2010.00,2012.0,2013.00,2014.0
Transit Timing Variations,4.0,2012.500000,1.290994,2011.0,2011.75,2012.5,2013.25,2014.0

In [218]:
#可直接指定組別(list、array、index...)
df = pd.DataFrame({'key':['A','B','C','A','B','C'],
                  'data1':range(6),
                  'data2':np.random.randint(0,10,6)},
                  columns=['key','data1','data2'])
df

  key  data1  data2
0   A      0      7
1   B      1      9
2   C      2      8
3   A      3      6
4   B      4      7
5   C      5      4

In [220]:
#by list
L=[11,12,13,13,12,11]
df.groupby(L).sum()

    data1  data2
11      5     11
12      5     16
13      5     14

In [222]:
#by dict
df2 = df.set_index('key') #除去index
mapping = {'A':'vowel','B':'consonant','C':'consonant'}
df2.groupby(mapping).sum()

           data1  data2
consonant     12     28
vowel          3     13

In [225]:
#by func
df2.groupby(str.lower).sum()

   data1  data2
a      3     13
b      5     16
c      7     12

In [228]:
#多重
print(df2.groupby([str.upper,mapping]).sum())
print(df2.groupby([mapping,str.upper]).sum())

             data1  data2
A vowel          3     13
B consonant      5     16
C consonant      7     12
             data1  data2
consonant B      5     16
          C      7     12
vowel     A      3     13

In [229]:
#多重的應用
decade = 10*(planets['year']//10)
decade = decade.astype(str)+'s'
decade.name = 'decade'
decade

0       2000s
1       2000s
2       2010s
3       2000s
4       2000s
5       2000s
6       2000s
7       1990s
8       2000s
9       2010s
10      2010s
11      2000s
12      2000s
13      1990s
14      2000s
15      2000s
16      1990s
17      1990s
18      2000s
19      2000s
20      2010s
21      2000s
22      2000s
23      2000s
24      2000s
25      1990s
26      2010s
27      2000s
28      2010s
29      2000s
        ...
1005    2010s
1006    2010s
1007    2010s
1008    2010s
1009    2010s
1010    2010s
1011    2010s
1012    2010s
1013    2010s
1014    2010s
1015    2010s
1016    2010s
1017    2010s
1018    2010s
1019    2010s
1020    2010s
1021    2010s
1022    2010s
1023    2010s
1024    2010s
1025    2010s
1026    2010s
1027    2010s
1028    2010s
1029    2010s
1030    2000s
1031    2000s
1032    2000s
1033    2000s
1034    2000s
Name: decade, Length: 1035, dtype: object

In [236]:
        # planets.groupby(['method',decade])  直接對應式合併並分組
planets.groupby(['method',decade])['number'].sum()

method                         decade
Astrometry                     2010s       2
Eclipse Timing Variations      2000s       5
                               2010s      10
Imaging                        2000s      29
                               2010s      21
Microlensing                   2000s      12
                               2010s      15
Orbital Brightness Modulation  2010s       5
Pulsar Timing                  1990s       9
                               2000s       1
                               2010s       1
Pulsation Timing Variations    2000s       1
Radial Velocity                1980s       1
                               1990s      52
                               2000s     475
                               2010s     424
Transit                        2000s      64
                               2010s     712
Transit Timing Variations      2010s       9
Name: number, dtype: int64

In [234]:
planets.groupby(['method',decade])['number'].sum().unstack()

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       NaN    NaN    NaN    2.0
Eclipse Timing Variations        NaN    NaN    5.0   10.0
Imaging                          NaN    NaN   29.0   21.0
Microlensing                     NaN    NaN   12.0   15.0
Orbital Brightness Modulation    NaN    NaN    NaN    5.0
Pulsar Timing                    NaN    9.0    1.0    1.0
Pulsation Timing Variations      NaN    NaN    1.0    NaN
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          NaN    NaN   64.0  712.0
Transit Timing Variations        NaN    NaN    NaN    9.0

In [239]:
planets.groupby(['method',decade])['number'].sum().unstack().fillna(0.0)

decade                         1980s  1990s  2000s  2010s
method
Astrometry                       0.0    0.0    0.0    2.0
Eclipse Timing Variations        0.0    0.0    5.0   10.0
Imaging                          0.0    0.0   29.0   21.0
Microlensing                     0.0    0.0   12.0   15.0
Orbital Brightness Modulation    0.0    0.0    0.0    5.0
Pulsar Timing                    0.0    9.0    1.0    1.0
Pulsation Timing Variations      0.0    0.0    1.0    0.0
Radial Velocity                  1.0   52.0  475.0  424.0
Transit                          0.0    0.0   64.0  712.0
Transit Timing Variations        0.0    0.0    0.0    9.0

In [240]:
# aggregate()
df.groupby('key').aggregate(['min',max,sum,np.median])

    data1                data2
      min max sum median   min max sum median
key
A       0   3   3    1.5     6   7  13    6.5
B       1   4   5    2.5     7   9  16    8.0
C       2   5   7    3.5     4   8  12    6.0

In [241]:
df.groupby('key').sum()

     data1  data2
key
A        3     13
B        5     16
C        7     12

In [247]:
df.groupby('key').aggregate({'data1':min,'data2':'max'})

     data1  data2
key
A        0      7
B        1      9
C        2      8

In [249]:
#fillter()
def filter_func(x):
    return x['data2'].std()>2
print(df)
print(df.groupby('key').std())
print(df.groupby('key').filter(filter_func))

  key  data1  data2
0   A      0      7
1   B      1      9
2   C      2      8
3   A      3      6
4   B      4      7
5   C      5      4
       data1     data2
key
A    2.12132  0.707107
B    2.12132  1.414214
C    2.12132  2.828427
  key  data1  data2
2   C      2      8
5   C      5      4

In [250]:
#transform()
df.groupby('key').transform(lambda x: x-x.mean())
# data1  A: (0+3)/2 = 1.5  B: (1+4)/2 = 2.5 C: (2+5)/2 = 3.5
# data1  0-1.5 = -1.5,  1-2.5 = -1.5, 2-3.5 = -1.5 ......

   data1  data2
0   -1.5    0.5
1   -1.5    1.0
2   -1.5    2.0
3    1.5   -0.5
4    1.5   -1.0
5    1.5   -2.0

In [251]:
#allpy()
def norm_by_data2(x):
    x['data1'] /= x['data2'].sum()
    return x
df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      7
1   B  0.062500      9
2   C  0.166667      8
3   A  0.230769      6
4   B  0.250000      7
5   C  0.416667      4